Mindmap & removed legacy
